Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །འདི་ན་སྡུག་བསྔལ་དང་། ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དཔལ་སྲུང་གི་སངས་རྒྱས་ཀྱི་ཞིང་སྨད་དུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན། རྩ་བ་དང་། རྩ་བའི་རྗེས་སུ་འགྲོ་བ་དང་། རྩ་བ་ཟད་པ་དང་། རྩ་བ་ཞི་བར་འགྱུར་བ་ཞེས་བྱའོ།
en: What are known here as suffering, its origin, cessation, and the path are known as the root, the appearance of the root, the dying off of the root, and destroying the root in the world called Irreproachable , the buddha realm of the Thus-Gone One Protector of Glory.

source: །འདི་ན་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་གནས་པ་རྣམས་ཞེས་བྱའོ།
en: What are known here as the applications of mindfulness are known elsewhere as abodes

source: །འདི་ན་ཡང་དག་པར་སྤོང་བ་རྣམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་ཁྱད་པར་དུ་གྲོལ་བ་རྣམས་ཞེས་བྱའོ།
en: What are known here as correct abandonments are known elsewhere as special liberations

source: །འདི་ན་རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་ཕྱོགས་སུ་འགྲོ་བ་རྣམས་ཞེས་བྱའོ།
en: What are known here as the bases of miraculous absorption are known elsewhere as directed movements

source: །འདི་ན་དབང་པོ་རྣམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་རབ་ཏུ་ཤེས་པ་རྣམས་ཞེས་བྱའོ།
en: What are known here as faculties are known elsewhere as comprehensions

source: །འདི་ན་སྟོབས་རྣམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་བསྟན་པ་རྣམས་ཞེས་བྱའོ།
en: What are known here as strengths are known elsewhere as teachings

source: །འདི་ན་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་རྗེས་སུ་འགྲོ་བ་རྣམས་ཞེས་བྱའོ།
en: What are known here as branches of awakening are known elsewhere as progressions

source: །འདི་ན་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་སྒྲོལ་བ་ཞེས་བྱའོ།
en: What is known here as path is known elsewhere as liberating

source: །འདི་ན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་མངོན་སུམ་གྱི་སྒོ་ཞེས་བྱའོ།
en: What are known here as correct discriminations are known elsewhere as doors of direct perception

source: །འདི་ན་ཆོས་ཀྱི་སྦྱིན་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་གཞན་དག་ན་ལེགས་པར་སྡུད་པ་ཞེས་བྱའོ།
en: What is known here as the gift of Dharma is known elsewhere as well summarized

source: །འདི་ན་ཞི་གནས་དང་། ལྷག་མཐོང་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་ཉེ་བར་ཞི་བ་དང་། རྣམ་པར་ལྟ་བ་ཞེས་བྱའོ།
en: What are known here as tranquility and special insight are known elsewhere as calming and observing

source: །འདི་ན་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དག་ནི་གཞན་དག་ན་དོན་ཡོད་པ་ཞེས་བྱའོ།
en: What is known here as liberation is known elsewhere as meaningful

source: །འདི་ན་བསོད་ནམས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་གཞན་དག་ན་ཕན་པ་ཞེས་བྱའོ།
en: What is known here as merit is known elsewhere as beneficial

source: །འདི་ན་ཡེ་ཤེས་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་གཞན་དག་ན་རྟོགས་བྱེད་ཅེས་བྱའོ།
en: What is known here as wisdom is known elsewhere as yielding realization

source: །འདི་ན་རབ་ཏུ་འབྱུང་བ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་གཞན་དག་ན་ལམ་གྱི་རྗེས་སུ་འགྲོ་བ་ཞེས་བྱའོ།
en: What is known here as going forth is known elsewhere as following the path

source: །འདི་ན་བསྙེན་པར་རྫོགས་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་གཞན་དག་ན་འདའ་བར་མི་བྱ་ཞེས་བྱའོ།
en: What is known here as ordaining is known elsewhere as nontransgressible

source: །འདི་ན་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་གཞན་དག་ན་ཉེ་བར་ཞི་བ་ཞེས་བྱའོ།
en: What is known here as nirvāṇa is known elsewhere as peacefulness

source: །འདི་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བསྔགས་པ་མཐའ་ཡས་པ་དང་ལྡན་པའོ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ནི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བགེགས་མེད་པའི་ཚུལ་ཅན་ནོ་ཞེས་བྱའོ།
en: What is known here as blessed buddhas graced with limitless praise is known in other worlds as blessed buddhas characterized as having no impediments

source: །ཀླུའི་བདག་པོ་ངེས་པའི་ཚིག་གི་ཚིག་དང་། བརྡའི་ཚིག་གི་ཚིག་འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དང་གཞན་དག་ཏུ་འབྱུང་སྟེ།
en: “Nāga Lord, these explanatory expressions and conventional expressions occur in other buddha realms.

source: མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་དེ་དག་གི་ངེས་པའི་ཚིག་ཅེས་བྱའོ།
en: In those buddha realms, they are called explanatory glosses by bodhisattvas who abide in the inexhaustible casket dhāraṇī.

source: །ཀླུའི་བདག་པོ་ངེས་པའི་ཚིག་གི་ཚིག་དང་། བརྡའི་ཚིག་གི་ཚིག་བསྟན་པ་ཕྱོགས་བཅུ་དག་ཏུ་འབྱུང་བ་གང་ཡིན་པ་དེ་དག་ནི་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་ངས་བསྟན་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ངེས་པའི་ཚིག་གི་ཚིག་དང་། བརྡའི་ཚིག་གི་ཚིག་བསྟན་པ་རྣམས་མཐར་ཐུག་པ་གང་ཡང་མེད་དོ།
en: Even if I were to describe the explanatory expressions and conventional expressions that arise throughout the ten directions for an eon or more, I would never reach the end of the description of such explanatory expressions and conventional expressions, which are employed throughout the buddha realms.”

source: །མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་བསྟན་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲུག་ཁྲིས་གཟུངས་ཐོབ་པར་གྱུར་ཏོ།
en: When this teaching on the inexhaustible casket dhāraṇī was given, sixty thousand bodhisattvas achieved dhāraṇī.

source: །བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་སྟོང་གིས་ནི་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Eight thousand bodhisattvas reached the acceptance that phenomena are unborn.

source: །མི་སུམ་ཁྲི་ཉིས་སྟོང་གིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: Thirty-two thousand people developed the mind set on unsurpassed and perfect awakening.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་མུན་པ་མུན་ནག་དང་བྲལ་བའི་ལམ་འདིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡང་དག་པར་སྒྲུབ་པར་བྱེད་དོ།
en: The Blessed One then said to Nāga King Sāgara, “Nāga Lord, bodhisattvas truly accomplish omniscience through this path that eliminates darkness.”

source: །མི་ཟད་པའི་ཟ་མ་ཏོག་གི་གཟུངས་ཀྱི་ལེའུ་སྟེ་གསུམ་པའོ།།
en: Chapter Three: The Inexhaustible Casket Dhāraṇī

source: །།ཀླུའི་བདག་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ་ཡུན་རིང་པོ་དཔག་ཏུ་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་སྔོན་རོལ་དུ་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན།
en: “Nāga Lord, at one point in the past, even longer than a countless eon ago, at a point so long ago that it defies reckoning or fathoming, there was an eon called Action.

source: བསྐལ་པ་རྣམ་པར་སྤྱོད་པ་ཞེས་བྱ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཁྱད་པར་གྱི་ཡོན་ཏན་བཀོད་པ་བསྡུས་པ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: At that time there was a world called Constellation of Unique Attributes in which the Blessed Buddha Divine King of Brahmā’s Splendor appeared.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚངས་པའི་དཔལ་ལྷའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་།
en: He was a thus-gone one, a worthy one, a perfect buddha, someone learned and virtuous, a well-gone one, a knower of the world, an unsurpassed charioteer who guides beings, and a teacher of gods and humans.

source: །དེའི་ཚེ་དེའི་དུས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཁྱད་པར་གྱི་ཡོན་ཏན་བཀོད་པ་བསྡུས་པ་དེ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བ་དང་། སྐྱེ་བོ་མང་པོ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱིས་གང་བར་གྱུར་ཏོ།
en: The world Constellation of Unique Attributes was at that time well-off, vast, and happy, had abundant harvests, was delightful, had many inhabitants, and was filled with gods and humans.

source: །སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་པ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་གླིང་བཞི་པར་གྱུར་ལ།
en: It was a four-continent world as large as the billion four-continent worlds in this buddha realm.

source: དེ་ལྟ་བུའི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དཔལ་ལྷའི་རྒྱལ་པོ་དེའི་འཇིག་རྟེན་གྱི་ཁམས་ཁྱད་པར་གྱི་ཡོན་ཏན་བཀོད་པ་བསྡུས་པར་གྱུར་ཏེ།
en: Thus, one billion such four-continent worlds constituted the Blessed Thus-Gone One Divine King of Brahmā’s Splendor’s world Constellation of Unique Attributes.

source: དེ་ལྟར་ཐ་གྲུ་ཆེ་ཞིང་ཡངས་པ་དེ་ལྟར་ཚད་མེད་དོ།
en: The extent of this world was immeasurable.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ནོར་བུ་རིན་པོ་ཆེ་རྡོ་རྗེའི་འོད་འདྲ་བར་གྱུར་ཏེ། དེ་ཉིད་ཀྱི་སྣང་བས་རྟག་ཏུ་སྣང་བར་གྱུར་ཏོ།
en: In this world shone the light of precious ever-luminous vajra jewels.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་རིན་པོ་ཆེའི་དྲ་བས་ཀུན་ཏུ་ཁེབས་ཤིང་དར་གྱི་ལྡ་ལྡི་མང་པོ་ནི་བཏགས། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བས་ནི་ལེགས་པར་བརྒྱན། བླ་རེ་ཆེན་པོ་རྣམས་ནི་བྲེས།
en: This world was draped with a net of jewels, hung with many silken banners, adorned with hoisted parasols, banners, and standards, and draped with great canopies.

source: མཚན་མོ་བར་སྣང་ལས་ཀྱང་སིལ་སྙན་བརྒྱ་སྟོང་དག་མ་བརྡུངས་མ་དཀྲོལ་བར་སྒྲ་རང་འབྱུང་སྟེ།
en: At night the sound of thousands of instruments resounded from the firmament unplayed, unstruck.

source: སིལ་སྙན་དང་། གླུ་དབྱངས་ཀྱི་སྒྲ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་མངོན་པར་གོ་བར་བྱས་ཏེ།
en: The sounds of instruments and song could be heard clearly by the entire trichiliocosm.

source: སིལ་སྙན་དང་། གླུ་དབྱངས་ཀྱི་སྒྲ་དེ་དག་ལས་འདོད་པ་དང་ལྡན་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཉོན་མོངས་པ་རབ་ཏུ་འབར་བའི་སྒྲ་ནི་མི་འབྱུང་གི །ཞི་བ་དང་། རབ་ཏུ་ཞི་བ་དང་། ཆོས་ཀྱི་དགའ་བ་དང་། མགུ་བ་དང་ལྡན་པའི་སྒྲ་དེ་དག་འབའ་ཞིག་འབྱུང་བར་གྱུར་ཏེ།
en: Such instruments and song did not reinforce desire, nor did they inflame attachment, aggression, delusion, and the afflictions. Rather peace, absolute peace, Dharma joy, and satisfaction issued from these sounds.

source: དེ་ཐོས་པ་ཙམ་གྱིས་ལྷ་དང་མི་དེ་དག་ཐམས་ཅད་ཀྱི་དྲན་པ་དང་། ཉེ་བར་ཞི་བ་དང་། དགའ་བ་དང་། བདེ་བ་ཐོབ་ལ་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་དག་ལ་གནོད་པར་མ་གྱུར་ཏོ།
en: By simply hearing them, all gods and humans attained mindfulness, peace, joy, and bliss, and they were no longer harmed by the afflictions.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་ལག་མཐིལ་ལྟར་མཉམ་ལ། ཀ་ཙ་ལི་ན་དའི་གོས་ལྟར་འཇམ་ཞིང་རེག་ན་བདེ་བར་གྱུར་ཏོ།
en: Additionally, the world was flat like the palm of a hand, soft and pleasing to the touch like fabric made from feathers of the kācilindi bird.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ངན་སོང་ངན་འགྲོར་གདགས་པ་མེད་དེ་ལྷ་དང་མི་དེ་དག་ཀྱང་དག་པ་འབའ་ཞིག་ཏུ་གྱུར་ཏོ།
en: The lower realms and poor migrations were not to be found in that world. Rather, its gods and humans lived in complete purity.

source: །དེ་དག་ནི་ཕལ་ཆེར་རྒྱ་ཆེན་པོ་ལ་མོས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་ཤ་སྟག་གོ།
en: For the most part, everyone was inspired toward vastness and had entered the Great Vehicle.

source: །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་ནི་ཉུང་ངོ་།
en: Practitioners of the vehicles of hearers and solitary buddhas were scarce.

source: །དེ་དག་གི་ལོངས་སྤྱོད་ཐམས་ཅད་ཀྱང་ཡིད་ལ་བསམས་པས་འབྱུང་ལ།
en: All manner of enjoyments arose simply by being imagined in the mind.

source: ལྷ་དང་མི་དེ་དག་བདེ་ཞིང་ལོངས་སྤྱོད་དང་ལྡན་པར་གྱུར་ཏོ། །དེ་ན་སུ་ཡང་སྡུག་པ་དང་དབུལ་པོ་མེད་དེ།
en: These gods and humans all experienced pleasures and enjoyments—none suffered or was poor.

source: དཔེར་ན་དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱད་པ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་ན་འཁོད་པའི་མི་རྣམས་ཀྱང་དེ་དང་འདྲ་བར་གྱུར་ཏོ།
en: The humans situated there were similar to the gods of the Heaven of Joy in their enjoyments and pleasures.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་ཚེའི་ཚད་ཀྱང་ལོ་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཕྲག་བརྒྱད་དུ་བསྒྲེས་པ་སྙེད་དུ་གྱུར་ཏོ།
en: The lifespan of this thus-gone one was counted as 67. million years.

source: །མི་དེ་དག་གི་ཚེའི་ཚད་ཀྱང་དེ་ཉིད་དོ།
en: The lifespan of the humans there was the same.

source: །དེ་ན་ཚེའི་མཐར་མ་ཕྱིན་པར་སུ་ཡང་འཆི་བ་མེད་དོ།
en: Nobody failed to live out their lifespan.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཡང་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཡོད་པར་གྱུར་ཏོ།
en: There were 7. billion bodhisattvas in the assembly of this thus-gone one;

source: །དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་ཚད་མེད་དོ།
en: his saṅgha of hearers was immeasurable.

source: །ཀླུའི་བདག་པོ་དེའི་ཚེ་དེའི་དུས་ན་དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གླིང་ཆེན་པོ་བཞིའི་དབང་ཕྱུག་གི་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Nāga Lord, at that time there was a universal monarch, a powerful lord of the four great continents named Inexhaustible Merit

source: རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་དེའི་བཙུན་མོ་བུད་མེད་ལྷ་མོ་དང་འདྲ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡོད་དེ།
en: King Inexhaustible Merit had 840 trillion goddess-like queens and women at his disposal.

source: དེ་དག་གི་ནང་ན་དེའི་བཙུན་མོ་དམ་པ་ནི་བཞི་ཡོད་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ།
en: Four among them were the most sublime of his queens.

source: དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དང་། དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་དང་། དག་པ་ཞེས་བྱ་བ་དང་། དགའ་ལྡན་མ་ཞེས་བྱ་བའོ།
en: They were named Vimalā, Vimalaprabhā, Purity , and Joyful Maiden.

source: །དེའི་བུ་ཡང་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་དེ་ཚན་པོ་ཆེའི་སྟོབས་དང་ལྡན་པ་མཚན་ཉི་ཤུ་རྩ་བརྒྱད་ཀྱི་གཟུགས་དང་ལྡན་པ་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་ཤ་སྟག་གོ།
en: They had eighty-four thousand sons that each had the strength of a mighty being. Their bodies had twenty-eight marks. They had all entered the Great Vehicle.

source: །ཀླུའི་བདག་པོ་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་དེ་ཡང་གྲོང་ཁྱེར་ཆེན་པོ་དགའ་འབྱུང་ཞེས་བྱ་བ་ན་གནས་སོ།
en: Nāga Lord, King Inexhaustible Merit lived in a great city called Presence of Joy.

source: །གྲོང་ཁྱེར་ཆེན་པོ་དེ་ཡང་ཤར་དང་། ནུབ་དང་། བྱང་དང་། ལྷོའི་ངོས་རེ་རེ་ལ་དཔག་ཚད་དྲུག་ཅུ་རྩ་བཞི་བཞི་ཡོད་པར་གྱུར་ཏོ།
en: The eastern, western, northern, and southern edges of the city measured sixty-four leagues each.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དཔལ་ལྷའི་རྒྱལ་པོ་ཡང་གྲོང་ཁྱེར་ཆེན་པོ་དགའ་འབྱུང་དེ་ཉིད་དུ་སྐུ་བལྟམ་མོ།
en: The Blessed Thus-Gone One Divine King of Brahmā’s Splendor was born in this great city Presence of Joy.

source: །གྲོང་ཁྱེར་ཆེན་པོ་དེའི་ནང་དུ་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པའི་ཕོ་བྲང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པར་གྱུར་ཏོ།
en: King Inexhaustible Merit's palace in this great city was built out of the seven precious substances.

source: །གྲོང་ཁྱེར་ཆེན་པོ་དེའི་ནང་ན་ལམ་པོ་ཆེ་དང་། སྲང་གི་སྒོ་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡོད་པར་གྱུར་ཏོ།
en: Within it were eight million four hundred thousand avenues and city gates.

source: །ལམ་པོ་ཆེ་དང་། སྲང་གི་སྒོ་ཐམས་ཅད་ན་ཡང་ཁྱིམ་བྱེ་བ་འབུམ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་གནས་སོ།
en: Alongside each avenue and city gate were eighty-four trillion households.

source: །གྲོང་ཁྱེར་ཆེན་པོ་དེ་ཡང་ར་བ་རིམ་བདུན་དང་། ལན་ཀན་རིམ་བདུན་དང་། ཏ་ལའི་ཕྲེང་རིམ་བདུན་དང་། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་རིམ་བདུན་གྱིས་བསྐོར་ཏོ།
en: The city was surrounded by seven rings of fences, railings, palm trees, and nets of bells, large and small.

source: །སྐྱེད་མོས་ཚལ་ཁྲིས་ཀྱང་བསྐོར་ཏོ།
en: It was also surrounded by ten thousand pleasure gardens.

source: །འོབས་བདུན་རིམ་གྱིས་ཀྱང་བསྐོར་ཏེ། འོབས་དེ་དག་ཀྱང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་ལ། མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། དྲི་མཆོག་གིས་ཁེབས་པ་ངང་ངུར་ལ་སོགས་པ་རྟག་ཏུ་སྐད་འབྱིན་པར་གྱུར་ཏེ།
en: Seven concentric moats encircled the city, each of which was filled with water with the eight qualities and covered with the most fragrant blue, pink, red, and white lotuses. Swans were constantly honking.

source: དེ་ལྟར་གྲོང་ཁྱེར་ཆེན་པོ་དེ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་དང་ལྡན་པར་གྱུར་ཏོ།
en: This great city was in this manner replete with unfathomable ornate qualities.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དཔལ་ལྷའི་རྒྱལ་པོ་དེ་ཡང་གྲོང་ཁྱེར་ཆེན་པོ་དགའ་འབྱུང་དེ་ཉིད་ན་ནགས་ཚལ་སྤོས་མཆོག་འོད་ཅེས་བྱ་བ་གང་དུ་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པས་བཅོམ་ལྡན་འདས་དེའི་གཙུག་ལག་ཁང་བྱས་པ་ན་བཞུགས་སོ།
en: The Blessed Thus-Gone One Divine King of Brahmā’s Splendor was staying in a monastery built for him by King Inexhaustible Merit in the grove Supreme Incense Light.

source: །རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་བུ་དང་བཅས། བཙུན་མོ་དང་བཅས། གཉེན་འདབ་དང་ཚལ་ཟའི་འཁོར་དང་བཅས་པས་བསྐལ་པ་འབུམ་ཐམ་པའི་བར་དུ་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡིད་དུ་འོང་བའི་བདེ་བའི་ཡོ་བྱད་དང་། ལོངས་སྤྱོད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་སོ།
en: With his retinue of children, queens, relatives, and dependents, King Inexhaustible Merit served this thus-gone one with all manner of pleasing and pleasurable substances and enjoyments for a hundred thousand eons.

source: །ཀླུའི་བདག་པོ་དེ་ནས་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་དེ་འཁོར་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དཔལ་ལྷའི་རྒྱལ་པོ་ག་ལ་བ་དེར་སོང་ནས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: “Nāga Lord, King Inexhaustible Merit and his retinue then went before the Blessed Thus-Gone One Divine King of Brahmā’s Splendor, bowed their heads toward him, and sat together.

source: །དེ་འོངས་པར་ཐུགས་སུ་ཆུད་ནས་དེ་བཞིན་གཤེགས་པ་དེས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་ན། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ཆོས་ཀྱི་དབང་ཕྱུག་ཐོབ་པར་གྱུར་ལ་དགེ་བའི་ཆོས་རྣམས་ཀྱིས་ཀྱང་ཁྱད་པར་དུ་འགྲོ་བར་གྱུར་ཏེ།
en: Acknowledging their arrival, the Blessed One said, ‘Great king, if one has four qualities, one will become a Dharma lord, a kṣatriya who has been crowned king, and will excel in virtuous qualities.

source: དད་པ་ལ་གནས་ཏེ། དགེ་བ་གང་ཡིན་པ་ཚོལ་ཞིང་ང་རྒྱལ་མེད་པར་འཕགས་པ་དག་གི་ཐད་དུ་འགྲོ་བ་དང་། ཆོས་དོན་དུ་གཉེར་ཏེ།
en: They are having faith such that one pursues virtues and can humbly go before the noble ones;

source: ཆོས་འདོད་ཅིང་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བས་དགའ་སྟེ།
en: having passion for the Dharma such that one yearns for the Dharma and is absolutely overjoyed about it;

source: རྟག་ཏུ་དོན་གྱི་རྗེས་སུ་ལྟ་བ་དང་། མི་རྟག་པའི་ཆོས་ཉིད་ལ་སོ་སོར་རྟོག་པ་དང་། འདུས་བྱས་ཀྱི་ཉེས་པ་རྟོགས་པ་དང་། ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་རྣམ་པར་འགྱུར་བའི་ཆོས་ཅན་ཡིན་ནོ་སྙམ་དུ་དྲན་པས་ཉེ་བར་གནས་པར་བྱེད་པ་དང་བག་ཡོད་པར་བྱེད་དེ།
en: generating thoughts that constantly consider the truth, discriminate the impermanent nature of phenomena, realize the defects of conditioned phenomena, and are mindful of the fact that all possessions are subject to change;

source: འདོད་པའི་ཡོན་ཏན་ཐམས་ཅད་ལ་ལྷག་པར་ཞེན་པ་མེད་ཅིང་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱང་ཟད་པར་མི་བྱེད་ལ་གོང་དུ་ཡང་རྣམ་པར་འཕེལ་བར་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་བསམ་པ་ཡང་རྣམ་པར་མི་སྤོང་བ་སྟེ།
en: and being conscientious so as to never abandon the intention of the mind set on awakening, cling to any sense pleasure, or allow one’s roots of virtue to degenerate, but rather cause them to increase further.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོས་ཆོས་ཀྱི་དབང་ཕྱུག་ཐོབ་པར་འགྱུར་ལ། དགེ་བའི་ཆོས་རྣམས་ཀྱིས་ཀྱང་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་རོ།
en: Great king, if one has these four qualities one will become a Dharma lord, a kṣatriya who has been crowned king, and will excel in virtuous qualities.’

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དཔལ་ལྷའི་རྒྱལ་པོ་ལ་རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་གང་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ལ་དབང་ཕྱུག་ཐོབ་པར་འགྱུར་ལགས།
en: “Then King Inexhaustible Merit asked the Thus-Gone One Divine King of Brahmā’s Splendor, ‘Blessed One, what qualities do bodhisattvas require to achieve mastery over the Dharma?’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ལ་དབང་ཕྱུག་ཐོབ་པར་འགྱུར་ཏེ།
en: “The Blessed One responded, ‘Great king, if they have eight qualities, bodhisattvas will achieve mastery over the Dharma.

source: རྣམ་པར་རྩེ་ཞིང་མི་ཉམས་པར་འགྲོ་བའི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཡིན།
en: They are possessing the five playful and undefiled higher knowledges of beings;

source: ཆགས་པ་མེད་པ་དང་། ཐོགས་པ་མེད་པ་དང་། བསྐྱོད་དུ་མེད་པའི་ཤེས་རབ་དང་ལྡན་པ་ཡིན།
en: possessing unbounded, unimpeded, and unmoving insight;

source: ཡེ་ཤེས་ཀྱིས་བསྡུས་པ་དང་། ཡོངས་སུ་སྦྱང་བར་བྱས་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་ལྡན་པ་ཡིན།
en: subsuming all within wisdom, engaging in purification, and possessing the four unconditioned bases of miraculous absorption;

source: ཤེས་རབ་དང་ཡེ་ཤེས་ངེས་པ་དང་། ལྟ་བ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བའི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ལྡན་པ་ཡིན།
en: possessing insight, wisdom, view, and the four correct discriminations devoid of all afflictive emotions;

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་དང་། ཆགས་པ་མེད་པའི་བྱིན་གྱི་རླབས་པས་བྱིན་གྱིས་བརླབས་ཀྱི་སྟོབས་དང་ལྡན་པ་ཡིན།
en: being blessed by a buddha and possessing the strength of being blessed with such unimpeded blessings;

source: བསོད་ནམས་མི་ཟད་པའི་རྒྱ་མཚོའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: possessing the inexhaustible merit of the oceanic seal of absorption;

source: སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བ་དང་། བརྗེད་ངས་པ་མེད་པ་ཡོངས་སུ་དག་པའི་གཟུངས་དང་ལྡན་པ་ཡིན།
en: pleasing all beings, exerting oneself for all the qualities of buddhahood, and possessing the dhāraṇī of pure recollection;

source: ཆོས་ཇི་ལྟ་བ་བཞིན་རྗེས་སུ་འགྲོ་བ་དང་། ཚུལ་གཅིག་པའི་ཆོས་ཀྱི་རྗེས་སུ་འགྲོ་བ་དང་། གཉིས་སུ་མེད་པ་ཡང་དག་པའི་མཐའ་ལ་གནས་པ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: and proceeding exactly according to the Dharma, following the Dharma of the single principle, abiding in the nondual limit of reality, and attaining the acceptance that phenomena are unborn.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་ཀྱི་དབང་ཕྱུག་ཐོབ་པར་འགྱུར་རོ།
en: Great king, if bodhisattvas have these eight qualities, they will achieve mastery over the Dharma.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་གཟུངས་ཡོད་དེ།
en: ‘Great king, additionally there is a dhāraṇī called the jeweled casket

source: དེ་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་དབང་ཕྱུག་ཐོབ་པར་གྱུར་ཏེ།
en: If bodhisattvas attain it, they will achieve mastery over the Dharma.’

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་གི་གཟུངས་ལས་བརྩམས་ནས། ལོ་འབུམ་གྱི་བར་དུ་རྒྱས་པར་རྣམ་པར་དབྱེ་བས་དེ་ལ་ཡང་དག་པར་བསྟན་ཏོ།
en: “The Thus-Gone One then taught on the jeweled casket dhāraṇī, making extensive classifications, for a hundred thousand years.

source: །རྒྱལ་པོ་བསོད་ནམས་མི་ཟད་པ་དེ་ཡང་རྒྱལ་པོའི་བྱ་བ་ཐམས་ཅད་བཏང་སྟེ། ལས་གཞན་མི་བྱེད་ལ་སེམས་ཀྱི་རྒྱུད་རྣམ་པར་གཡེངས་པ་མེད་པར་དཔུང་དང་བཅས་འཁོར་དང་བཅས་པས་ཆོས་མཉན་ཏེ།
en: King Inexhaustible Merit gave up all his royal duties and listened to the Dharma, without distraction or competing pursuits, alongside his supporters and retinue.

source: དེས་ལོ་འབུམ་པོ་དེའི་བར་དུ་འདོད་པའི་རྟོག་པའམ། གནོད་སེམས་ཀྱི་རྟོག་པའམ། རྣམ་པར་འཚེ་བའི་རྣམ་པར་རྟོག་པའམ། བུ་དང་། ཆུང་མ་དང་། རྒྱལ་སྲིད་དང་། ཡོངས་སུ་འཛིན་པ་དང་། སྡུག་པ་ཐམས་ཅད་ལ་ངེས་པའི་རྟོག་པ་རྣམས་ལ་བརྟག་པར་མ་བསམས་ཏེ།
en: For that period of one hundred thousand years, they had no desirous, malicious, or violent thoughts, nor did they entertain any thoughts about children, wives, political dominion, possessions, or lovely things.

source: ཆོས་ལ་སྡུག་པར་ངེས་པ་ཡིད་ལ་བྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་བསམ་པ་ལ་གནས་པར་གྱུར་པ་དང་། བྱམས་པ་ཆེན་པོས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆ་བགོས་ནས་ཆོས་འབའ་ཞིག་མཉན་ཏོ།
en: Rather, they happily dwelled in trust in the Dharma and the intention of the mind set on awakening. With great love, their minds viewed all beings the same way and, donning the armor of great compassion, they solely concerned themselves with listening to the Dharma.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་ལས་ལོ་འབུམ་ཐམ་པའི་བར་དུ་དམ་པའི་ཆོས་ཉན་ཏེ། ཐོས་ནས་ཀྱང་རིན་པོ་ཆེའི་ཟ་མ་ཏོག་གི་གཟུངས་འདི་ཉིད་ཀྱི་རྩ་བ་ཡོངས་སུ་སྦྱང་བ་བྱས་སོ།
en: Not only did they hear the sublime Dharma from the Blessed One for a hundred thousand years, they also trained in the root of this very jeweled casket dhāraṇī.

source: །དེ་བསྐལ་པས་ཡ་ཕྲག་བདུན་གྱི་འཁོར་བ་ཕྱིར་བསྙིལ་བར་གྱུར་ཏོ།
en: For seven million eons they practiced in order to exit saṃsāra.

source: །བསྐལ་པ་ཁྲིའི་བར་དུ་ལས་ཀྱི་སྒྲིབ་པ་བསགས་པ་ནི་རྣམ་པར་དག་པར་གྱུར་ཏོ།
en: They purified the karmic obscurations amassed over ten thousand eons.

source: །སངས་རྒྱས་འབུམ་ནི་དེའི་མིག་ལམ་དུ་སྣང་བར་གྱུར་ཏོ།
en: A hundred thousand buddhas appeared before their eyes.

source: །སངས་རྒྱས་བྱེ་བ་ཕྲག་འབུམ་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་བའི་དགེ་བའི་རྩ་བ་ཡང་དེས་ཡོངས་སུ་གཟུང་བའོ།
en: They took hold of enough roots of virtue to directly see a trillion buddhas.

source: །གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་དུ་འགྱུར་བ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་འཐོབ་པའི་དགེ་བའི་རྩ་བ་ཡང་བསྐྱེད་དོ།
en: They developed the roots of virtue to attain the dominion of a universal monarch and become śakras, brahmās, and world protectors as many times as there are grains of sand in the Ganges.
